In [1]:
import pandas as pd

In [5]:
dict1={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
      'Marks':[98,89,99,87,90,83,99],
      'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']}
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display Top 3 Rows of the Dataset

In [7]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2. Cehck Last 3 Rows of The Dataset

In [8]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. Find Shape of Our Dataset(Number of Rows & Number of Columns)

In [9]:
df1.shape

(7, 3)

In [14]:
print('Number of Rows :', df1.shape[0])
print('Number of Columns :', df1.shape[1])

Number of Rows : 7
Number of Columns : 3

## 4. Get Information About Our Dataset Like Total Numbers of Rows, Total Number of Columns, Datatypes of Each Column and Memory Requirement

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5. Check Null Values In The Dataset

In [22]:
df1.isnull().sum(axis=0) ## null value count colum by

Name      0
Marks     0
Gender    0
dtype: int64

## 6. Get Overall Statistics About The Dataframe

In [24]:
df1.describe(include='all') #statistics about all coumn , default is only for numerical column Marks
# df1.describe()

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN



## 7. Find Unique Values From The Gender Column

In [27]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [26]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find The Number of Unique values from the Gender column

In [31]:
df1['Gender'].nunique()

2

## 9. Display Count of Unique Values In Gender Column

In [33]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 10. Find Total Number of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [36]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [41]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [40]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [45]:
## Between mehtod
sum(df1['Marks'].between(90,100))

4

## 11. Find Average Marks

In [47]:
# Average marks
df1['Marks'].mean()

92.14285714285714

In [48]:
df1['Marks'].min()

83

In [49]:
df1['Marks'].max()

99

## 12. Apply Method

In [54]:
def marks(x):
    return x//2

In [55]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [56]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [57]:
## apply method and lambda function
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [58]:
## find len of Name columns
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

In [60]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [61]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14. Drop the Column(s)

In [62]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [63]:
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [65]:
# if want to drop multiple columns
## *** if want to modified existing data frame inplace=True
df1.drop(['Male_Female','Half_marks'], axis=1, inplace=True)

In [66]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 15. Print Name of the Columns

In [68]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [69]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort The Dataframe As Per The Marks Column

In [70]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [72]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [74]:
## sorting by multiple columns
df1.sort_values(by=['Marks','Gender'], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## 17. Display Name & Marks of The Female Students

In [75]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [81]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [87]:
## isin()
df1[df1['Gender'].isin(['Female'])][['Name','Marks','Gender']]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female